app/Http/Controllers/MealController.php

select * from `meals` order by `created_at` desc limit 4 offset 0
select * from `users` where `users`.`id` in (1, 2)
select count(*) as aggregate from `meals`
---
    public function index()
    {
        $meals = Meal::with('user')->latest()->paginate(4);

select * from `categories`
---
    public function create()
    {
        $categories = Category::all();

insert into `meals` (`title`, `body`, `user_id`, `image`, `updated_at`, `created_at`) values ('ああ', 'ああ', 1, '20220927120526_sample_photo_01.jpg', '2022-09-27 12:05:26', '2022-09-27 12:05:26')
insert into `meals` (`title`, `body`, `user_id`, `category_id`, `image`, `updated_at`, `created_at`) values ('444', '444', 1, '3', '20220930005924_sample_photo_03.jpg', '2022-09-30 00:59:24', '2022-09-30 00:59:24')
---
    public function store(MealRequest $request)
    {
        $meal = new Meal($request->all());

        $meal->user_id = $request->user()->id;
        $meal->category_id = $request->category_id;
        // dd($meal);

        $file = $request->file('image');
        $meal->image = self::createFileName($file);


        // トランザクション開始
        DB::beginTransaction();
        try {
            // 登録
            $meal->save();

select * from `meals` where `meals`.`id` = '18' limit 1
---
    public function show($id)
    {
        $meal = Meal::find($id);

select * from `categories`
select * from `meals` where `meals`.`id` = '18' limit 1
---
    public function edit($id)
    {
        $categories = Category::all();
        $meal = Meal::find($id);

select * from `meals` where `meals`.`id` = '18' limit 1
update `meals` set `title` = '15-3-3-2-3', `body` = '15-3-3-2-3', `image` = '20220930091611_sample_photo_01.jpg', `category_id` = '3', `meals`.`updated_at` = '2022-09-30 09:16:11' where `id` = 18
---
    public function update(MealRequest $request, $id)
    {
        $meal = Meal::find($id);
        $meal->category_id = $request->category_id;
        // dd($meal);

        if ($request->user()->cannot('update', $meal)) {
            return redirect()->route('meals.show', $meal)
                ->withErrors('自分の記事以外は更新できません');
        }

        $file = $request->file('image');
        if ($file) {
            $delete_file_path = $meal->image_path;
            $meal->image = self::createFileName($file);
        }
        $meal->fill($request->all());

        // トランザクション開始
        DB::beginTransaction();
        try {
            // 更新
            $meal->save();

select * from `meals` where `meals`.`id` = '11' limit 1
delete from `meals` where `id` = 11
---
    public function destroy($id)
    {
        $meal = Meal::find($id);

        // トランザクション開始
        DB::beginTransaction();
        try {
            $meal->delete();